[
    {
        "author": "u/pmz",
        "posted_at": "22:35:09 12:35",
        "title": "How I added C-style for-loops to Python",
        "description": "description not found",
        "post_link": "https://www.reddit.com/r/Python/comments/wje4on/how_i_added_cstyle_forloops_to_python/"
    },
    {
        "author": "u/siilkysmooth",
        "posted_at": "22:36:09 12:36",
        "title": "Python Selenium Action: Run Selenium with Python via Github Actions using Headless or Non-Headless browsers!",
        "description": "description not found",
        "post_link": "https://www.reddit.com/r/Python/comments/wjdo9b/python_selenium_action_run_selenium_with_python/"
    },
    {
        "author": "u/Individual_Volume562",
        "posted_at": "22:36:09 12:36",
        "title": "Python TUI menu with ChorusFruit module is easy",
        "description": "I Created this Simple TUI Menu with ChorusFruit in python\nIf you like it up vote\nThe Code is in my Github: https://github.com/manifarizi/ChorusFruit\nMore about module: https://pypi.org/project/ChorusFruit/\n",
        "post_link": "https://www.reddit.com/r/Python/comments/wjdmjv/python_tui_menu_with_chorusfruit_module_is_easy/"
    },
    {
        "author": "u/ploomber-io",
        "posted_at": "22:37:09 12:37",
        "title": "debuglater: Serialize Python traceback for later debugging",
        "description": "Hi r/Python!\nWe just released debuglater, an open-source library that serializes a Python traceback object for later debugging.\ndebuglater demo\nCountless times, we've scheduled overnight jobs to find out the following day that they failed. While logs are helpful, they are often insufficient for debugging. debuglater allows you to store the traceback object so you can start a debugging session at any moment.\nWe built this to support our open-source framework for data scientists, who often execute long-running code in remote environments. However, we realized this could be useful for the Python community, so we created a separate package. This project is a fork of Eli Finer's pydump, so kudos to him for laying the foundations! We made a few improvements like compatibility with recent Python versions and integration with IPython/Jupyter.\nThe implementation is quite interesting. You can see it here. The serialization step has two parts: it takes the traceback object and wraps it into a new object so it can be serialized; secondly, it stores the source code so you can debug even if you don't have access to the source code!\nPlease take it for a spin and let us know your feedback. Feel free to open an issue on GitHub!\n",
        "post_link": "https://www.reddit.com/r/Python/comments/wjbeq1/debuglater_serialize_python_traceback_for_later/"
    },
    {
        "author": "u/anuctal",
        "posted_at": "22:37:09 12:37",
        "title": "Python Poetry vs Pipenv - side by side comparison",
        "description": "Hi all,\nI made a 1 minute length video - side by side comparison of Poetry and Pipenv.\nVideo:https://youtu.be/aZTmnCkCa3M\nI hope you will like it!Thanks for watching!\n",
        "post_link": "https://www.reddit.com/r/Python/comments/wjbaay/python_poetry_vs_pipenv_side_by_side_comparison/"
    },
    {
        "author": "u/foosion",
        "posted_at": "22:37:09 12:37",
        "title": "Python 3.11.0rc1 is out",
        "description": "Python 3.11.0rc1 is out. It's in final form other than clear bug fixes, if any. Beta 5 seemed good enough for me.\nIt's faster than 3.10 and has some nice new features. https://docs.python.org/3.11/whatsnew/3.11.html\nhttps://www.python.org/downloads/release/python-3110rc1/\n",
        "post_link": "https://www.reddit.com/r/Python/comments/wjatwc/python_3110rc1_is_out/"
    },
    {
        "author": "u/trollimitzu_",
        "posted_at": "22:38:09 12:38",
        "title": "Boss wants me to make a student management system",
        "description": "I work abroad as a teacher and have been working on learning Python for about 3-4 months. Me and my boss are fairly close so he asks me if I can make something like a student management system that will allow teachers to put in grades, assignments and comments about students behavior. From what I gathered it will need the following\nLogin Portal for parents\nLogin portal for teachers\nBe able to add classes and students\nBe able to input grades for classes and store them\nExport the stored grades as a PDF\nadd comments on the student that can be exported as a PDF (preferably same as above)\nGive some basic stats on the students attendance and grades\nI said I would think about it since it seems well out of my depth. I am just about learning about OOP right now and from what I understand the things I will need to do require somewhat of an intermediate level of knowledge.\nI was thinking about using Python and Flask since those are what I am familiar with.\nAm I way out of my depth? This could be super cool on my CV, and a great opportunity to build something but I don't want to agree to something that is not in the realm of reality. Would these things be that difficult to implement?\n\n(We are currently using Google classroom so at the minimum this needs to replicate that applications basic functionality, and trust me it is basic)\n",
        "post_link": "https://www.reddit.com/r/Python/comments/wj94jh/boss_wants_me_to_make_a_student_management_system/"
    },
    {
        "author": "u/AmicusRecruitment",
        "posted_at": "22:38:09 12:38",
        "title": "Python Live: Kubeflow Update and Demonstration",
        "description": "Kubeflow requires an advanced team with vision and perseverance, and so does solving the world’s hardest problems.\nThis Kubeflow update will cover:\nWhat is Kubeflow and why market leaders use Kubeflow\nUser feedback from Kubeflow User Survey\nAn update on Kubeflow 1.6\nKubeflow use case demo - Build a pipeline from a jupyter notebook\nHow to get involved with Kubeflow.\nWith over 7,000 slack members, Kubeflow is the open source machine learning platform that delivers Kubernetes native operations. Kubeflow integrates software components for model development, training, visualization and tuning, along with pipeline deployments, and model serving. It supports popular frameworks i.e. tensorflow, keras, pytorch, xgboost, mxnet, scikit learn and provides kubernetes operating efficiencies.\nIn this workshop, Josh Bottum will review why market leaders are using Kubeflow and important feedback received in the Kubeflow User Survey. He will also review the Kubeflow release process and the benefits coming in Kubeflow 1.6. Demo gods willing, Josh will also provide a quick demo of how to build a Kubeflow pipeline from a Jupyter notebook. He will finish with information on how to get involved in the Kubeflow Community.\nJosh Bottum has volunteered as a Kubeflow Community Product Manager since 2019. Over the last 12 releases, Josh has helped the Kubeflow project by running community meetings, triaging GitHub issues, answering slack questions, recruiting code contributors, running user surveys, developing release roadmaps and presentations, writing blog posts, and providing Kubeflow demonstrations.\nPlease don't be put off by having to register, this is a free live coding walk-through with a Q&A with Josh :) If you'd like to see a different topic showcased in the future please let us know! https://www.eventbrite.co.uk/e/python-live-kubeflow-update-and-demonstration-tickets-395193653857\n",
        "post_link": "https://www.reddit.com/r/Python/comments/wj93b7/python_live_kubeflow_update_and_demonstration/"
    },
    {
        "author": "u/Alexander_Selkirk",
        "posted_at": "22:38:09 12:38",
        "title": "Interesting Discussion on the difficulties of package managers (here, Nix) with Python dependency issues",
        "description": "description not found",
        "post_link": "https://www.reddit.com/r/Python/comments/wj8jgo/interesting_discussion_on_the_difficulties_of/"
    },
    {
        "author": "u/Responsible-Air-5081",
        "posted_at": "22:39:09 12:39",
        "title": "My first internship project",
        "description": "For more than 3 months I have been looking for an opportunity to prove myself somewhere, I had the opportunity to get a job through an internship in one company.\nStack - Python/FastAPI/Redis/Docker/Locust/Alchemy/Alembic/Pytest - Thinking about deploy on Azure/AWS\nI will be glad if you point out any shortcomings or express your opinion\n\nleirons/edvantis_petStore (github.com)\n",
        "post_link": "https://www.reddit.com/r/Python/comments/wj7g7k/my_first_internship_project/"
    }
]